* 2017-9-1 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-2 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-3 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-4 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-5 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-6 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-7 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-8 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-9 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-10 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-11 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-12 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-13 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-14 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-15 [100%]


** DONE Study

*** TODO 下载CAIDA Security数据集

*** TODO 异常流量注入背景流量

*** DONE Wireshark 分析

*** DONE 编写程序提取字段

** DONE Work

*** DONE Latex 数学公式

*** DONE C++ 模板 

*** DONE Git分支 学习

测试 添加文本

** DONE Life

*** DONE Git复习

* 2017-9-16 [100%]

** DONE Study

*** DONE 流量字段提取

** DONE Work

*** DONE Qt5 第3章

** DONE Life

* 2017-9-17 [100%]

** DONE Study

*** DONE 对提取的字段分类统计，计算熵，计算哈希值，比较汉明距离

** DONE Work

*** DONE git ignore学习
    CLOCK: [2017-09-17 周日 07:07]--[2017-09-17 周日 07:39] =>  0:32

** DONE Life

* 2017-9-18 [33%]

** DONE Study

*** DONE 阅读背景流量的描述

由WIDE研究小组发起，日本学术和研究机构合作的MAWI项目在日本骨干网架设了多个被动测量点，重点测量IPv6、DNS和BGP信息，并提供部分数据的共享。

*** DONE Experiment

以背景流量为测试数据，调整参数，使得汉明距离趋于稳定。

*** DONE CAIDA申请

取消此计划。不使用CAIDA数据集。

*** DONE DARPA数据集

** TODO Work

*** TODO C++模板

** TODO Life

* 2017-9-19 [100%]

** DONE Study

*** DONE 了解DARPA数据集

*** DONE 数据预处理

过滤非网络连接

** DONE Work

** DONE Life

* 2017-9-20 [%]

** TODO Study

*** DONE 了解DARPA数据集

*** DONE 下载DOS攻击的数据集，测试实验效果

** TODO Work

** TODO Life

* 2017-9-21 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-22 [%]

** TODO Study

*** TODO 测试感知哈希的效果

** TODO Work

** TODO Life

* 2017-9-23 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-24 [100%]

** DONE Study

*** DONE DARPA攻击相关的翻译

** DONE Work

*** DONE 模板参数，成员模板
    CLOCK: [2017-09-24 周日 16:24]--[2017-09-24 周日 16:45] =>  0:21

** DONE Life

*** DONE CNN News 一篇
    CLOCK: [2017-09-24 周日 16:51]--[2017-09-24 周日 17:49] =>  0:58

*** DONE 做饭，吃饭，洗碗
    CLOCK: [2017-09-24 周日 18:08]--[2017-09-24 周日 18:47] =>  0:39
    CLOCK: [2017-09-24 周日 17:54]--[2017-09-24 周日 18:07] =>  0:13

* 2017-9-25 [100%]

** DONE Study

** DONE Work

*** DONE 控制实例化，效率与灵活性
    CLOCK: [2017-09-25 周一 16:14]--[2017-09-25 周一 16:54] =>  0:40

*** TODO 牛客网练习10道
    CLOCK: [2017-09-25 周一 20:05]--[2017-09-25 周一 21:15] =>  1:10

*** TODO 算法导论 第六章
    CLOCK: [2017-09-25 周一 21:51]

** DONE Life

*** DONE CNN News 一篇
    CLOCK: [2017-09-25 周一 16:55]--[2017-09-25 周一 18:47] =>  1:52

* 2017-9-26 [100%]

** DONE Study

** DONE Work

*** DONE 类型转换与模板类型参数 函数模板显式实参
    CLOCK: [2017-09-26 周二 20:08]--[2017-09-26 周二 20:33] =>  0:25

*** DONE 维护堆的性质  建堆
    CLOCK: [2017-09-26 周二 20:43]--[2017-09-26 周二 21:17] =>  0:34

** DONE Life

* 2017-9-27 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-28 [%]

** TODO Study

** TODO Work

** TODO Life

* 2017-9-29 [%]

** TODO Study

*** TODO 找出缓冲区溢出攻击的特征

*** TODO 写程序提取缓冲区溢出攻击的特征

** TODO Work

*** TODO 模板实参推断和引用
    CLOCK: [2017-09-29 周五 06:41]--[2017-09-29 周五 07:18] =>  0:37

*** 《算法导论》

** TODO Life

* 2017-9-30 [%]

** TODO Study

** TODO Work

** TODO Life

